+++
title = "Perceptron"
+++

This is tomorrow's work, but for now I just want to test some codeblocks:


#+begin_src sh
pwd
#+end_src

#+begin_src command-line
pwd
#+end_src

#+begin_src treeview
.
├── LICENSE
├── README.md
├── archetypes
├── assets
├── backup
├── config
├── content
├── data
├── eslint.config.mjs
├── go.mod
├── go.sum
├── hugo-mod-json-resume
├── hugo-theme-gruvbox-inkscape.svg
├── hugo-theme-gruvbox.svg
├── hugo_stats.json
├── i18n
├── layouts
├── node_modules
├── package-lock.json
├── package.hugo.json
├── package.json
├── postcss.config.js
├── public
├── resources
├── static
└── theme.toml

14 directories, 13 files

#+end_src

#+RESULTS:
| ./  |             |   |       |
| ├── | _index.org  |   |       |
| └── | _index.org~ |   |       |
|     |             |   |       |
| 1   | directory,  | 2 | files |


#+ATTR_HTML: :class line-numbers
#+begin_src c
  #include <stdio.h>

  int main() {
    char a[5] = "hello";
    printf("%s world!\n", a);
    return 0;
  }

#+end_src

#+begin_export html
<pre class="command-line language-bash" data-user="root" data-host="localhost">
  <code>
    cd /usr/local/etc
    cp php.ini php.ini.bak
    vi php.ini
  </code>
</pre>

<pre
  class="command-line language-bash"
  data-user="chris"
  data-host="remotehost"
  data-output="2, 4-8"
>
  <code>
    pwd
    /usr/home/chris/bin
    ls -la
    total 2
    drwxr-xr-x   2 chris  chris     11 Jan 10 16:48 .
    drwxr--r-x  45 chris  chris     92 Feb 14 11:10 ..
    -rwxr-xr-x   1 chris  chris    444 Aug 25  2013 backup
    -rwxr-xr-x   1 chris  chris    642 Jan 17 14:42 deploy
  </code>
</pre>
#+end_export


#+begin_export html
<pre class="line-numbers language-none" data-start="42">
  <code>
    Hello,
    World!

    Foo
    Bar
  </code>
</pre>

#+end_export
